Revit 2027 API
ElectricalDemandFactorDefinition.AddValue Method
 Adds a value to the value set for this demand factor definition
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddValue(
	ElectricalDemandFactorValue dfValue
)
Public Sub AddValue (
	dfValue As ElectricalDemandFactorValue
)
public:
void AddValue(
	ElectricalDemandFactorValue^ dfValue
)
member AddValue :
        dfValue : ElectricalDemandFactorValue -> unit
Parameters
dfValue ElectricalDemandFactorValue
 Value to add to the set
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace